turbq/atprog/packs/atmel/SAM4N_DFP/1.0.49/atdf/ATSAM4N8A.atdf
      <value-group caption="" name="CHIPID_CIDR__NVPSIZ">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8 Kbytes" name="_8K" value="0x1"/>
        <value caption="16 Kbytes" name="_16K" value="0x2"/>
        <value caption="32 Kbytes" name="_32K" value="0x3"/>
        <value caption="64 Kbytes" name="_64K" value="0x5"/>
        <value caption="128 Kbytes" name="_128K" value="0x7"/>
        <value caption="256 Kbytes" name="_256K" value="0x9"/>
        <value caption="512 Kbytes" name="_512K" value="0xA"/>
        <value caption="1024 Kbytes" name="_1024K" value="0xC"/>
        <value caption="2048 Kbytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__NVPSIZ2">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8 Kbytes" name="_8K" value="0x1"/>
        <value caption="16 Kbytes" name="_16K" value="0x2"/>
        <value caption="32 Kbytes" name="_32K" value="0x3"/>
        <value caption="64 Kbytes" name="_64K" value="0x5"/>
        <value caption="128 Kbytes" name="_128K" value="0x7"/>
        <value caption="256 Kbytes" name="_256K" value="0x9"/>
        <value caption="512 Kbytes" name="_512K" value="0xA"/>
        <value caption="1024 Kbytes" name="_1024K" value="0xC"/>
        <value caption="2048 Kbytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__SRAMSIZ">
        <value caption="48 Kbytes" name="_48K" value="0x0"/>
        <value caption="192 Kbytes" name="_192K" value="0x1"/>
        <value caption="2 Kbytes" name="_2K" value="0x2"/>
        <value caption="6 Kbytes" name="_6K" value="0x3"/>
        <value caption="24 Kbytes" name="_24K" value="0x4"/>
        <value caption="4 Kbytes" name="_4K" value="0x5"/>
        <value caption="80 Kbytes" name="_80K" value="0x6"/>
        <value caption="160 Kbytes" name="_160K" value="0x7"/>
        <value caption="8 Kbytes" name="_8K" value="0x8"/>
        <value caption="16 Kbytes" name="_16K" value="0x9"/>
        <value caption="32 Kbytes" name="_32K" value="0xA"/>
        <value caption="64 Kbytes" name="_64K" value="0xB"/>
        <value caption="128 Kbytes" name="_128K" value="0xC"/>
        <value caption="256 Kbytes" name="_256K" value="0xD"/>
        <value caption="96 Kbytes" name="_96K" value="0xE"/>
        <value caption="512 Kbytes" name="_512K" value="0xF"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__ARCH">
        <value caption="AT91SAM9xx Series" name="AT91SAM9xx" value="0x19"/>
        <value caption="AT91SAM9XExx Series" name="AT91SAM9XExx" value="0x29"/>
        <value caption="AT91x34 Series" name="AT91x34" value="0x34"/>
        <value caption="CAP7 Series" name="CAP7" value="0x37"/>
        <value caption="CAP9 Series" name="CAP9" value="0x39"/>
        <value caption="CAP11 Series" name="CAP11" value="0x3B"/>
        <value caption="AT91x40 Series" name="AT91x40" value="0x40"/>
        <value caption="AT91x42 Series" name="AT91x42" value="0x42"/>
        <value caption="AT91SAM4SH2 Series" name="AT91SAM4SH2" value="0x45"/>
        <value caption="AT91x55 Series" name="AT91x55" value="0x55"/>
        <value caption="AT91SAM7Axx Series" name="AT91SAM7Axx" value="0x60"/>
        <value caption="AT91SAM7AQxx Series" name="AT91SAM7AQxx" value="0x61"/>
        <value caption="AT91x63 Series" name="AT91x63" value="0x63"/>
        <value caption="SAM4CxC Series (100-pin version)" name="SAM4CxxC" value="0x64"/>
        <value caption="SAM4CxE Series (144-pin version)" name="SAM4CxxE" value="0x66"/>
        <value caption="AT91SAM7Sxx Series" name="AT91SAM7Sxx" value="0x70"/>
        <value caption="AT91SAM7XCxx Series" name="AT91SAM7XCxx" value="0x71"/>
        <value caption="AT91SAM7SExx Series" name="AT91SAM7SExx" value="0x72"/>
        <value caption="AT91SAM7Lxx Series" name="AT91SAM7Lxx" value="0x73"/>
        <value caption="AT91SAM7Xxx Series" name="AT91SAM7Xxx" value="0x75"/>
        <value caption="AT91SAM7SLxx Series" name="AT91SAM7SLxx" value="0x76"/>
        <value caption="SAM3UxC Series (100-pin version)" name="SAM3UxC" value="0x80"/>
        <value caption="SAM3UxE Series (144-pin version)" name="SAM3UxE" value="0x81"/>
        <value caption="SAM3AxC Series (100-pin version)" name="SAM3AxC" value="0x83"/>
        <value caption="SAM3XxC Series (100-pin version)" name="SAM3XxC" value="0x84"/>
        <value caption="SAM3XxE Series (144-pin version)" name="SAM3XxE" value="0x85"/>
        <value caption="SAM3XxG Series (208/217-pin version)" name="SAM3XxG" value="0x86"/>
        <value caption="AT91x92 Series" name="AT91x92" value="0x92"/>
        <value caption="SAM4NxA Series (48-pin version)" name="SAM4NxA" value="0x93"/>
        <value caption="SAM4NxB Series (64-pin version)" name="SAM4NxB" value="0x94"/>
        <value caption="SAM4NxC Series (100-pin version)" name="SAM4NxC" value="0x95"/>
        <value caption="SAM3SDxB Series (64-pin version)" name="SAM3SDxB" value="0x99"/>
        <value caption="SAM3SDxC Series (100-pin version)" name="SAM3SDxC" value="0x9A"/>
        <value caption="SAM5A" name="SAM5A" value="0xA5"/>
        <value caption="SAM4LxA Series (48-pin version)" name="SAM4LxA" value="0xB0"/>
        <value caption="SAM4LxB Series (64-pin version)" name="SAM4LxB" value="0xB1"/>
        <value caption="SAM4LxC Series (100-pin version)" name="SAM4LxC" value="0xB2"/>
        <value caption="AT75Cxx Series" name="AT75Cxx" value="0xF0"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__NVPTYP">
        <value caption="ROM" name="ROM" value="0x0"/>
        <value caption="ROMless or on-chip Flash" name="ROMLESS" value="0x1"/>
        <value caption="Embedded Flash Memory" name="FLASH" value="0x2"/>
        <value caption="ROM and Embedded Flash Memory- NVPSIZ is ROM size- NVPSIZ2 is Flash size" name="ROM_FLASH" value="0x3"/>
        <value caption="SRAM emulating ROM" name="SRAM" value="0x4"/>
      </value-group>
    </module>
    <module caption="Embedded Flash Controller" name="EFC" version="6450J">
      <register-group name="EFC">
        <register caption="EEFC Flash Mode Register" name="EEFC_FMR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Ready Interrupt Enable" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Wait State" mask="0x00000F00" name="FWS"/>
          <bitfield caption="Sequential Code Optimization Disable" mask="0x00010000" name="SCOD"/>
          <bitfield caption="Flash Access Mode" mask="0x01000000" name="FAM"/>
          <bitfield caption="Code Loops Optimization Enable" mask="0x04000000" name="CLOE"/>
        </register>
        <register caption="EEFC Flash Command Register" name="EEFC_FCR" offset="0x04" rw="W" size="4">
          <bitfield caption="Flash Command" mask="0x000000FF" name="FCMD" values="EEFC_FCR__FCMD"/>
          <bitfield caption="Flash Command Argument" mask="0x00FFFF00" name="FARG"/>
          <bitfield caption="Flash Writing Protection Key" mask="0xFF000000" name="FKEY" values="EEFC_FCR__FKEY"/>
        </register>
        <register caption="EEFC Flash Status Register" name="EEFC_FSR" offset="0x08" rw="R" size="4">
          <bitfield caption="Flash Ready Status" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Command Error Status" mask="0x00000002" name="FCMDE"/>
          <bitfield caption="Flash Lock Error Status" mask="0x00000004" name="FLOCKE"/>
          <bitfield caption="Flash Error Status" mask="0x00000008" name="FLERR"/>
        </register>
        <register caption="EEFC Flash Result Register" name="EEFC_FRR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Flash Result Value" mask="0xFFFFFFFF" name="FVALUE"/>
        </register>
      </register-group>
      <value-group caption="" name="EEFC_FCR__FCMD">
        <value caption="Get Flash Descriptor" name="GETD" value="0x00"/>
        <value caption="Write page" name="WP" value="0x01"/>
        <value caption="Write page and lock" name="WPL" value="0x02"/>
        <value caption="Erase page and write page" name="EWP" value="0x03"/>
        <value caption="Erase page and write page then lock" name="EWPL" value="0x04"/>
        <value caption="Erase all" name="EA" value="0x05"/>
        <value caption="Erase Pages" name="EPA" value="0x07"/>
        <value caption="Set Lock Bit" name="SLB" value="0x08"/>
        <value caption="Clear Lock Bit" name="CLB" value="0x09"/>
        <value caption="Get Lock Bit" name="GLB" value="0x0A"/>
        <value caption="Set GPNVM Bit" name="SGPB" value="0x0B"/>
        <value caption="Clear GPNVM Bit" name="CGPB" value="0x0C"/>
        <value caption="Get GPNVM Bit" name="GGPB" value="0x0D"/>
        <value caption="Start Read Unique Identifier" name="STUI" value="0x0E"/>
        <value caption="Stop Read Unique Identifier" name="SPUI" value="0x0F"/>
        <value caption="Get CALIB Bit" name="GCALB" value="0x10"/>
        <value caption="Erase Sector" name="ES" value="0x11"/>
        <value caption="Write User Signature" name="WUS" value="0x12"/>
        <value caption="Erase User Signature" name="EUS" value="0x13"/>
        <value caption="Start Read User Signature" name="STUS" value="0x14"/>
        <value caption="Stop Read User Signature" name="SPUS" value="0x15"/>
      </value-group>
